In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sbn 
import plotly 
import plotly.offline as p

In [2]:
data = pd.read_csv(r"E:\github\Logistic Regression\titanic\titianic_train.csv")
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
data.drop(["PassengerId","Name","SibSp","Parch","Ticket"],axis=1,inplace=True)

In [4]:
data.drop(["Cabin"],axis=1,inplace=True)

In [5]:
data.head()

   Survived  Pclass     Sex   Age     Fare Embarked
0         0       3    male  22.0   7.2500        S
1         1       1  female  38.0  71.2833        C
2         1       3  female  26.0   7.9250        S
3         1       1  female  35.0  53.1000        S
4         0       3    male  35.0   8.0500        S

In [6]:
Sex = pd.get_dummies(data["Sex"],drop_first=True)
Sex

     male
0       1
1       0
2       0
3       0
4       1
..    ...
886     1
887     0
888     0
889     1
890     1

[891 rows x 1 columns]

In [7]:
Embarked = pd.get_dummies(data["Embarked"],drop_first=True)
Embarked

     Q  S
0    0  1
1    0  0
2    0  1
3    0  1
4    0  1
..  .. ..
886  0  1
887  0  1
888  0  1
889  0  0
890  1  0

[891 rows x 2 columns]

In [8]:
data = pd.concat([data,Embarked,Sex],axis=1)
data.head()

   Survived  Pclass     Sex   Age     Fare Embarked  Q  S  male
0         0       3    male  22.0   7.2500        S  0  1     1
1         1       1  female  38.0  71.2833        C  0  0     0
2         1       3  female  26.0   7.9250        S  0  1     0
3         1       1  female  35.0  53.1000        S  0  1     0
4         0       3    male  35.0   8.0500        S  0  1     1

In [9]:
data.drop(["Embarked","Sex"],axis=1,inplace=True)
data.head()

   Survived  Pclass   Age     Fare  Q  S  male
0         0       3  22.0   7.2500  0  1     1
1         1       1  38.0  71.2833  0  0     0
2         1       3  26.0   7.9250  0  1     0
3         1       1  35.0  53.1000  0  1     0
4         0       3  35.0   8.0500  0  1     1

In [10]:
data.isnull().sum()

Survived      0
Pclass        0
Age         177
Fare          0
Q             0
S             0
male          0
dtype: int64

In [11]:
mean = data["Age"].mean()
mean = round(mean)
print(mean)
med = data["Age"].median()
print(med)
mode = data["Age"].mode()
print(mode)

30
28.0
0    24.0
dtype: float64

In [12]:
data["Age"].fillna(mean,inplace=True)
data.head()

   Survived  Pclass   Age     Fare  Q  S  male
0         0       3  22.0   7.2500  0  1     1
1         1       1  38.0  71.2833  0  0     0
2         1       3  26.0   7.9250  0  1     0
3         1       1  35.0  53.1000  0  1     0
4         0       3  35.0   8.0500  0  1     1

In [13]:
# data.isnull().sum()
X = data.drop("Survived",axis=1)
y = data["Survived"]
print(X.shape)
print(y.shape)

(891, 6)
(891,)

In [14]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.4, random_state=42)
print(X_train.shape)
print(X_test.shape)
print(y_train.shape)
print(y_test.shape)

(534, 6)
(357, 6)
(534,)
(357,)

In [15]:
from sklearn.linear_model import LogisticRegression
# from sklearn.tree import DecisionTreeClassifier
tlr = LogisticRegression()
tlr.fit(X_train,y_train)

C:\Users\LENOVO\anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:762: ConvergenceWarning:

lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression

LogisticRegression()

In [16]:
y_pred = tlr.predict(X_test)

In [17]:
from sklearn.metrics import classification_report,confusion_matrix,accuracy_score,mean_absolute_error

In [18]:
classification_report = classification_report(y_test,y_pred)
print(classification_report)

              precision    recall  f1-score   support

           0       0.81      0.85      0.83       216
           1       0.75      0.70      0.72       141

    accuracy                           0.79       357
   macro avg       0.78      0.77      0.77       357
weighted avg       0.79      0.79      0.79       357

In [19]:
confusion_matrix = confusion_matrix(y_test,y_pred)
print(confusion_matrix)

[[183  33]
 [ 43  98]]

In [20]:
acc = (85+52)/(85+22+20+52)
print((acc*100))

76.53631284916202

In [21]:
accuracy_score = accuracy_score(y_test,y_pred)
print(accuracy_score)

0.7871148459383753

In [22]:
if((tlr.predict([[3,4,16.7,0,1,0]]))==1):
    print("Survived")
else:
    print("Sorry Not Survived")

Survived

In [23]:
data["Survived"].value_counts()

0    549
1    342
Name: Survived, dtype: int64